# pandas operators

In [71]:
import pandas as pd
import numpy as np

In [72]:
d = {'col1':[1,2,3,4],
     'col2':[45,55,65,45],
     'col3':['asd','jkl','qwe','xyz']
    
}

In [73]:
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [74]:
df['col2'].unique()

array([45, 55, 65], dtype=int64)

In [77]:
len(df['col2'])

4

In [78]:
df['col2'].nunique()

3

In [79]:
df['col2'].value_counts()

45    2
55    1
65    1
Name: col2, dtype: int64

In [80]:
# apply method
def times5(x):
    return x*5

In [82]:
times5(10)

50

In [83]:
df['col1'].sum()

10

In [84]:
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [85]:
df['col1'].apply(times5)

0     5
1    10
2    15
3    20
Name: col1, dtype: int64

In [86]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [87]:
df.drop('col1',axis=1)

   col2 col3
0    45  asd
1    55  jkl
2    65  qwe
3    45  xyz

In [88]:
# to save it permanently inplace=True

In [89]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [90]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [93]:
df.sort_values('col2')# values of col2 sorted

   col1  col2 col3
0     1    45  asd
3     4    45  xyz
1     2    55  jkl
2     3    65  qwe

In [94]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [95]:
# false means there is no null value is the column